package 阿里.T20260328;
/*
【阿里研发岗】2026-3-28-第一题-值
HARD  时间限制：1000ms  空间限制：256M

题目描述
给定一个正整数 x，请你构造一个十进制正整数 n，使得 n 的十进制数位长度与 n 的值的乘积恰好等于 x。
这里，十进制数位长度指的是 n 的十进制表示中，去掉所有前导零后剩余的数字个数。例如：0 的数位长度为 1，7 的数位长度为 1，120 的数位长度为 3。

输入描述
每个测试文件均包含多组测试数据。
第一行输入一个整数 T(1 <= T <= 2 * 10^5)，表示数据组数。
此后 T 行，每行输入一个正整数 x(1 <= x <= 10^18)。

输出描述
对于每组数据，输出一个整数。如果存在 len(n) * n = x，输出任意一个符合条件的 n；如果不存在输出 -1。其中 n 必须为正整数，且满足 1 <= n <= 10^18。
如果存在多个解决方案，您可以输出任意一个，系统会自动判定是否正确。

样例1
输入
4
1
3
20
200

输出
1
3
10
-1

 */
public class T1 {
    public static void main(String[] args){

    }
}
